////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////// Работа с переменными \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
////////////////////////////////////////////////////////////////////////////////////////////////

// Создайте переменную num и присвойте ей значение 3. Выведите значение этой переменной
// на экран с помощью метода alert.

// const num = 3;
//alert(num);

////////////////////////////////////////////////////////////////////////////////////////////////

// Создайте переменные a = 10 и b = 2. Выведите на экран их сумму, разность, произведение
// и частное(результат деления).

// const a = 10;
// const b = 2;

// const c = a + b;
// const d = a * b;
// const e = a / b;

// console.log(c, d, e);

////////////////////////////////////////////////////////////////////////////////////////////////

// Создайте переменные c = 15 и d = 2. Просуммируйте их, а результат присвойте переменной
// result.Выведите на экран значение переменной result.

// const c = 15;
// const d = 2;
// const result = c * d;

// console.log(result);

////////////////////////////////////////////////////////////////////////////////////////////////

// Создайте переменные a = 10, b = 2 и c = 5. Выведите на экран их сумму.

// const a = 10;
// const b = 2;
// const c = 5;

// const result = a + b + c;

// console.log(result);

////////////////////////////////////////////////////////////////////////////////////////////////

// Создайте переменные a = 17 и b = 10. Отнимите от a переменную b и результат присвойте
// переменной c.Затем создайте переменную d, присвойте ей значение 7. Сложите переменные c и d,
// а результат запишите в переменную result.Выведите на экран значение переменной result.

// const a = 17;
// const b = 10;
// const c = a - b;
// const d = 7;
// const result = c * d;

// console.log(result);

////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////// Работа со строками \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
////////////////////////////////////////////////////////////////////////////////////////////////

// Создайте переменную str и присвойте ей значение 'Привет, Мир!'.
// Выведите значение этой переменной на экран.

// const str = "Привет, Мир!";
// console.log(str);

////////////////////////////////////////////////////////////////////////////////////////////////

// Создайте переменные str1 = 'Привет, ' и str2 = 'Мир!'.С помощью этих переменных
// и операции сложения строк выведите на экран фразу 'Привет, Мир!'.

// const str1 = "Привет, ";
// const str2 = "Мир!";

// console.log(str1, str2);

////////////////////////////////////////////////////////////////////////////////////////////////

// Создайте переменную name и присвойте ей ваше имя.Выведите на экран фразу 'Привет, %Имя%!'.

// const name = "Серёга";
// console.log("Привет,", name);

////////////////////////////////////////////////////////////////////////////////////////////////

// Создайте переменную age и присвойте ей ваш возраст.Выведите на экран 'Мне %Возраст% лет!'.

// const age = 27;
// console.log(`Мне ${age} лет!`);

////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////// Функция prompt \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
////////////////////////////////////////////////////////////////////////////////////////////////

// Спросите имя пользователя с помощью методы prompt.Выведите с помощью alert сообщение 'Ваше имя %имя%'.

// const name = prompt("Введите Ваше имя", "Имя");

// alert(`Ваше имя ${name}`);

////////////////////////////////////////////////////////////////////////////////////////////////

// Спросите у пользователя число.Выведите с помощью alert квадрат этого числа.

// const number = prompt("Введите число");
// alert(number * number);

////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////// Обращение к символам строки \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
////////////////////////////////////////////////////////////////////////////////////////////////

// Создайте переменную str и присвойте ей значение 'abcde'.Обращаясь к отдельным
// символам этой строки выведите на экран символ 'a', символ 'c', символ 'e'.

// const str = "abcde";
// console.log(str[0], str[2], str[4]);

////////////////////////////////////////////////////////////////////////////////////////////////

// Перевел строку в числа, через функцию multiplication создал массив, потом этот массив перевел в числа

// const num = "12345";
// const newNumbers = Number(num);

// const multiplication = function () {
//   let arr = [];
//   //   console.log(arr);
//   for (let i = 0; i < arguments.length; i += 1) {
//     arr.push(arguments[i]);
//   }

//   let newArr = 0;
//   for (let i = 0; i < arr.length; i += 1) {
//     newArr = arr[i];
//   }
//   console.log(newArr);

//   return newArr;
// };

// console.log(multiplication(newNumbers));

// multiplication(newNumbers);

////////////////////////////////////////////////////////////////////////////////

// преобразует строку '12345' в массив чисел [1, 2, 3, 4, 5]

// const num = "12345";
// const getNumbers = function (num) {
//   let res = [];
//   let base = 10;
//   let currNum = Math.abs(num);
//   do {
//     let baseShiftedNum = Math.floor(currNum / base);
//     let diff = currNum - baseShiftedNum * base;
//     res.unshift(diff);
//     currNum = baseShiftedNum;
//   } while (currNum > 0);
//   console.log(res);
//   return res;
// };

// getNumbers(num);

// const newNumbers = Number(num);

////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////// Работа с массивами \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
////////////////////////////////////////////////////////////////////////////////////////////////

// Создайте массив arr = ['a', 'b', 'c'].Выведите его на экран с помощью функции alert.

// const arr = ["a", "b", "c"];
// alert(arr);

////////////////////////////////////////////////////////////////////////////////////////////////
// С помощью массива arr из предыдущего номера выведите на экран содержимое первого,
// второго и третьего элементов.

// const arr = ["a", "b", "c"];
// alert(arr[0] + arr[1] + arr[2]);

////////////////////////////////////////////////////////////////////////////////////////////////
//Создайте массив arr = ['a', 'b', 'c', 'd'] и с его помощью выведите на экран строку 'a+b, c+d'.

// const arr = ["a", "b", "c", "d"];
// console.log(`${arr[0]} + ${arr[1]}, ${arr[2]} + ${arr[3]}`);

////////////////////////////////////////////////////////////////////////////////////////////////
// Создайте массив arr с элементами 2, 5, 3, 9. Умножьте первый элемент массива на второй,
// а третий элемент на четвертый.Результаты сложите, присвойте переменной result.
// Выведите на экран значение этой переменной.

// const arr = [2, 5, 3, 9];
// const first = arr[0] * arr[1];
// const second = arr[2] * arr[3];
// const result = first + second;

// console.log(result);

////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////// Объекты(ассоциативные массивы) \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
////////////////////////////////////////////////////////////////////////////////////////////////
// Создайте объект obj.Выведите на экран элемент с ключом 'c' двумя способами:
//bчерез квадратные скобки и как свойство объекта:

// const obj = { a: 1, b: 2, c: 3 };

// console.log(obj.c);
// console.log(obj["c"]);

////////////////////////////////////////////////////////////////////////////////////////////////

// Создайте массив заработных плат obj.Выведите на экран зарплату Пети и Коли.
// const obj = { Коля: "1000", Вася: "500", Петя: "200" };

// console.log(obj.Петя, obj.Коля);

// console.log(`Зарплата Пети: ${obj.Петя}, Зарплата Коли: ${obj.Коля}`);

////////////////////////////////////////////////////////////////////////////////////////////////

// Создайте объект с днями недели. Ключами в нем должны служить номера дней от
// начала недели(понедельник - первый и т.д.).Выведите на экран текущий день недели.

// const definition = "Сегодня день:";

// const days = {
//   first: "понедельник - первый",
//   second: "вторник - второй",
//   third: "среда - третий",
//   fourth: "четверг - четвертый",
//   fivth: "пятница - пятый",
//   sixth: "суббота - шестой",
//   seventh: "воскресение - седьмой",
// };

// // console.log(definition, days.first);
// const currentDay = days.first;
// console.log(definition, currentDay);

// const key = "День недели";
// const object = {};

// object[key] = "Понедельник";
// console.log(object); // {День недели: 'Понедельник'}

////////////////////////////////////////////////////////////////////////////////////////////////

// Пусть теперь номер дня недели хранится в переменной day, например там лежит число 3.
//Выведите день недели, соответствующий значению переменной day.

////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////Многомерные массивы\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////////
// Дан массив[[1, 2, 3], [4, 5, 6], [7, 8, 9]].Выведите на экран цифру 4 из этого массива.

// const array = [
//   [1, 2, 3],
//   [4, 5, 6],
//   [7, 8, 9],
// ];
// console.log(array[1][0]);

////////////////////////////////////////////////////////////////////////////////////////////////
//Дан объект { js: ['jQuery', 'Angular'], php: 'hello', css: 'world' }.Выведите с его помощью слово 'jQuery'.

// const object = {
//   js: ["jQuery", "Angular"],
//   php: "hello",
//   css: "world",
// };

// console.log(object.js[0]);

////////////////////////////////////////////////////////////////////////////////////////////////
// Создайте двухмерный массив.Первые два ключа - это 'ru' и 'en'.Пусть первый ключ содержит элемент,
// являющийся массивом названий дней недели по - русски, а второй - по - английски.
// Выведите с помощью этого массива понедельник по - русски и среду по английски
// (пусть понедельник - это нулевой день).

// const object = {
//   ru: [
//     "понедельник",
//     "вторник",
//     "среда",
//     "четверг",
//     "пятница",
//     "суббота",
//     "воскресение",
//   ],
//   en: [
//     "monday",
//     "tuesday",
//     "wednesday",
//     "thursday",
//     "friday",
//     "saturday",
//     "sunday",
//   ],
// };
// console.log(object.ru[0], object.en[2]);

// Пусть теперь в переменной lang хранится язык(она принимает одно из значений или 'ru',
// или 'en' - либо то, либо то), а в переменной day - номер дня.Выведите словом день недели,
// соответствующий переменным lang и day.То есть: если, к примеру, lang = 'ru' и day = 3 - то
// выведем 'среда'.

// const arr = {
//   ru: ["пон", "втр", "ср", "чет", "пят", "сб", "вс"],
//   en: ["mon", "tue", "wen", "thur", "fri", "str", "sun"],
// };

// const langRu = arr.ru;
// const langEn = arr.en;

// const day = 3;
// const dayOfDay = day - 1;

// alert(langRu[dayOfDay]);
// alert(langEn[dayOfDay]);

////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////Работа с if-else\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////////
// Если переменная a равна нулю, то выведите 'Верно', иначе выведите 'Неверно'.Проверьте работу
// скрипта при a, равном 1, 0, -3.

// const a = 0;
// let message = "";
// if (a === 0) {
//   message = "Верно";
// } else {
//   message = "Не верно";
// }
// console.log(message);

////////////////////////////////////////////////////////////////////////////////////////////////
// Если переменная a больше нуля, то выведите 'Верно', иначе выведите 'Неверно'.Проверьте работу
// скрипта при a, равном 1, 0, -3.

////////////////////////////////////////////////////////////////////////////////////////////////
// Если переменная a меньше нуля, то выведите 'Верно', иначе выведите 'Неверно'.Проверьте работу
// скрипта при a, равном 1, 0, -3.

////////////////////////////////////////////////////////////////////////////////////////////////
// Если переменная a больше или равна нулю, то выведите 'Верно', иначе выведите 'Неверно'.
// Проверьте работу скрипта при a, равном 1, 0, -3.

////////////////////////////////////////////////////////////////////////////////////////////////
// Если переменная a меньше или равна нулю, то выведите 'Верно', иначе выведите 'Неверно'.
// Проверьте работу скрипта при a, равном 1, 0, -3.

////////////////////////////////////////////////////////////////////////////////////////////////
// Если переменная a не равна нулю, то выведите 'Верно', иначе выведите 'Неверно'.Проверьте работу
// скрипта при a, равном 1, 0, -3.

////////////////////////////////////////////////////////////////////////////////////////////////
// Если переменная a равна 'test', то выведите 'Верно', иначе выведите 'Неверно'.Проверьте работу
// скрипта при a, равном 'test', 'тест', 3.

////////////////////////////////////////////////////////////////////////////////////////////////
// Если переменная a равна '1' и по значению и по типу, то выведите 'Верно', иначе выведите 'Неверно'.
// Проверьте работу скрипта при a, равном '1', 1, 3.

////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////Работа с логическими переменными\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////////
// Если переменная test равна true, то выведите 'Верно', иначе выведите 'Неверно'.Проверьте работу
// скрипта при test, равном true, false.Напишите два варианта скрипта - с короткой записью и с длинной.

////////////////////////////////////////////////////////////////////////////////////////////////
// Если переменная test не равна true, то выведите 'Верно', иначе выведите 'Неверно'.Проверьте
// работу скрипта при test, равном true, false.Напишите два варианта скрипта - с короткой записью и с длинной.

////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////Работа с && (и) и || (или)\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////////
// Если переменная a больше нуля и меньше 5 - ти, то выведите 'Верно', иначе выведите 'Неверно'.
// Проверьте работу скрипта при a, равном 5, 0, -3, 2.

////////////////////////////////////////////////////////////////////////////////////////////////
// Если переменная a равна нулю или равна двум, то прибавьте к ней 7, иначе поделите ее на 10.
//Выведите новое значение переменной на экран.Проверьте работу скрипта при a, равном 5, 0, -3, 2.

////////////////////////////////////////////////////////////////////////////////////////////////
// Если переменная a равна или меньше 1, а переменная b больше или равна 3, то выведите сумму этих
// переменных, иначе выведите их разность(результат вычитания).Проверьте работу скрипта при a и b,
// равном 1 и 3, 0 и 6, 3 и 5.

////////////////////////////////////////////////////////////////////////////////////////////////
// Если переменная a больше 2 - х и меньше 11 - ти, или переменная b больше или равна 6 - ти и меньше 14 - ти,
// то выведите 'Верно', в противном случае выведите 'Неверно'.

////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////На switch-case\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////////
// Переменная num может принимать 4 значения: 1, 2, 3 или 4. Если она имеет значение '1', то в
// переменную result запишем 'зима', если имеет значение '2' – 'весна' и так далее.Решите задачу
// через switch-case.

// Задачи
//В переменной day лежит какое - то число из интервала от 1 до 31. Определите в какую декаду месяца
// попадает это число (в первую, вторую или третью).

// В переменной month лежит какое-то число из интервала от 1 до 12. Определите в какую пору года
// попадает этот месяц(зима, лето, весна, осень).

// Дана строка, состоящая из символов, например, 'abcde'. Проверьте, что первым символом этой
// строки является буква 'a'.Если это так - выведите 'да', в противном случае выведите 'нет'.

// Дана строка с цифрами, например, '12345'. Проверьте, что первым символом этой строки является
// цифра 1, 2 или 3. Если это так - выведите 'да', в противном случае выведите 'нет'.

// Дана строка из 3-х цифр. Найдите сумму этих цифр. То есть сложите как числа первый символ
// строки, второй и третий.

// Дана строка из 6-ти цифр. Проверьте, что сумма первых трех цифр равняется сумме вторых трех
/// цифр.Если это так - выведите 'да', в противном случае выведите 'нет'.
