////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////// Работа с переменными \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
////////////////////////////////////////////////////////////////////////////////////////////////

// Создайте переменную num и присвойте ей значение 3. Выведите значение этой переменной
// на экран с помощью метода alert.

// const num = 3;
//alert(num);

////////////////////////////////////////////////////////////////////////////////////////////////

// Создайте переменные a = 10 и b = 2. Выведите на экран их сумму, разность, произведение
// и частное(результат деления).

// const a = 10;
// const b = 2;

// const c = a + b;
// const d = a * b;
// const e = a / b;

// console.log(c, d, e);

////////////////////////////////////////////////////////////////////////////////////////////////

// Создайте переменные c = 15 и d = 2. Просуммируйте их, а результат присвойте переменной
// result.Выведите на экран значение переменной result.

// const c = 15;
// const d = 2;
// const result = c * d;

// console.log(result);

////////////////////////////////////////////////////////////////////////////////////////////////

// Создайте переменные a = 10, b = 2 и c = 5. Выведите на экран их сумму.

// const a = 10;
// const b = 2;
// const c = 5;

// const result = a + b + c;

// console.log(result);

////////////////////////////////////////////////////////////////////////////////////////////////

// Создайте переменные a = 17 и b = 10. Отнимите от a переменную b и результат присвойте
// переменной c.Затем создайте переменную d, присвойте ей значение 7. Сложите переменные c и d,
// а результат запишите в переменную result.Выведите на экран значение переменной result.

// const a = 17;
// const b = 10;
// const c = a - b;
// const d = 7;
// const result = c * d;

// console.log(result);

////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////// Работа со строками \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
////////////////////////////////////////////////////////////////////////////////////////////////

// Создайте переменную str и присвойте ей значение 'Привет, Мир!'.
// Выведите значение этой переменной на экран.

// const str = "Привет, Мир!";
// console.log(str);

////////////////////////////////////////////////////////////////////////////////////////////////

// Создайте переменные str1 = 'Привет, ' и str2 = 'Мир!'.С помощью этих переменных
// и операции сложения строк выведите на экран фразу 'Привет, Мир!'.

// const str1 = "Привет, ";
// const str2 = "Мир!";

// console.log(str1, str2);

////////////////////////////////////////////////////////////////////////////////////////////////

// Создайте переменную name и присвойте ей ваше имя.Выведите на экран фразу 'Привет, %Имя%!'.

// const name = "Серёга";
// console.log("Привет,", name);

////////////////////////////////////////////////////////////////////////////////////////////////

// Создайте переменную age и присвойте ей ваш возраст.Выведите на экран 'Мне %Возраст% лет!'.

// const age = 27;
// console.log(`Мне ${age} лет!`);

////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////// Функция prompt \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
////////////////////////////////////////////////////////////////////////////////////////////////

// Спросите имя пользователя с помощью методы prompt.Выведите с помощью alert сообщение 'Ваше имя %имя%'.

// const name = prompt("Введите Ваше имя", "Имя");

// alert(`Ваше имя ${name}`);

////////////////////////////////////////////////////////////////////////////////////////////////

// Спросите у пользователя число.Выведите с помощью alert квадрат этого числа.

// const number = prompt("Введите число");
// alert(number * number);

////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////// Обращение к символам строки \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
////////////////////////////////////////////////////////////////////////////////////////////////

// Создайте переменную str и присвойте ей значение 'abcde'.Обращаясь к отдельным
// символам этой строки выведите на экран символ 'a', символ 'c', символ 'e'.

// const str = "abcde";
// console.log(str[0], str[2], str[4]);

////////////////////////////////////////////////////////////////////////////////////////////////

// Создайте переменную num и присвойте ей значение '12345'.Найдите произведение(умножение) цифр этого числа.

// const num = "12345";
// //   const result = Number(array);
// const multiplication = function () {
//   let arr = [];
//   for (let i = 0; i < arguments.length; i += 1) {
//     arr.push(arguments[i]);
//   }
//   return arr;
// };

// console.log(multiplication(num));

////////////////////////////////////////////////////////////////////////////////////////////////
