////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////// Работа с переменными \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
////////////////////////////////////////////////////////////////////////////////////////////////

// Создайте переменную num и присвойте ей значение 3. Выведите значение этой переменной
// на экран с помощью метода alert.

// const num = 3;
//alert(num);

////////////////////////////////////////////////////////////////////////////////////////////////

// Создайте переменные a = 10 и b = 2. Выведите на экран их сумму, разность, произведение
// и частное(результат деления).

// const a = 10;
// const b = 2;

// const c = a + b;
// const d = a * b;
// const e = a / b;

// console.log(c, d, e);

////////////////////////////////////////////////////////////////////////////////////////////////

// Создайте переменные c = 15 и d = 2. Просуммируйте их, а результат присвойте переменной
// result.Выведите на экран значение переменной result.

// const c = 15;
// const d = 2;
// const result = c * d;

// console.log(result);

////////////////////////////////////////////////////////////////////////////////////////////////

// Создайте переменные a = 10, b = 2 и c = 5. Выведите на экран их сумму.

// const a = 10;
// const b = 2;
// const c = 5;

// const result = a + b + c;

// console.log(result);

////////////////////////////////////////////////////////////////////////////////////////////////

// Создайте переменные a = 17 и b = 10. Отнимите от a переменную b и результат присвойте
// переменной c.Затем создайте переменную d, присвойте ей значение 7. Сложите переменные c и d,
// а результат запишите в переменную result.Выведите на экран значение переменной result.

// const a = 17;
// const b = 10;
// const c = a - b;
// const d = 7;
// const result = c * d;

// console.log(result);

////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////// Работа со строками \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
////////////////////////////////////////////////////////////////////////////////////////////////

// Создайте переменную str и присвойте ей значение 'Привет, Мир!'.
// Выведите значение этой переменной на экран.

// const str = "Привет, Мир!";
// console.log(str);

////////////////////////////////////////////////////////////////////////////////////////////////

// Создайте переменные str1 = 'Привет, ' и str2 = 'Мир!'.С помощью этих переменных
// и операции сложения строк выведите на экран фразу 'Привет, Мир!'.

// const str1 = "Привет, ";
// const str2 = "Мир!";

// console.log(str1, str2);

////////////////////////////////////////////////////////////////////////////////////////////////

// Создайте переменную name и присвойте ей ваше имя.Выведите на экран фразу 'Привет, %Имя%!'.

// const name = "Серёга";
// console.log("Привет,", name);

////////////////////////////////////////////////////////////////////////////////////////////////

// Создайте переменную age и присвойте ей ваш возраст.Выведите на экран 'Мне %Возраст% лет!'.

// const age = 27;
// console.log(`Мне ${age} лет!`);

////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////// Функция prompt \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
////////////////////////////////////////////////////////////////////////////////////////////////

// Спросите имя пользователя с помощью методы prompt.Выведите с помощью alert сообщение 'Ваше имя %имя%'.

// const name = prompt("Введите Ваше имя", "Имя");

// alert(`Ваше имя ${name}`);

////////////////////////////////////////////////////////////////////////////////////////////////

// Спросите у пользователя число.Выведите с помощью alert квадрат этого числа.

// const number = prompt("Введите число");
// alert(number * number);

////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////// Обращение к символам строки \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
////////////////////////////////////////////////////////////////////////////////////////////////

// Создайте переменную str и присвойте ей значение 'abcde'.Обращаясь к отдельным
// символам этой строки выведите на экран символ 'a', символ 'c', символ 'e'.

// const str = "abcde";
// console.log(str[0], str[2], str[4]);

////////////////////////////////////////////////////////////////////////////////////////////////

// Перевел строку в числа, через функцию multiplication создал массив, потом этот массив перевел в числа

// const num = "12345";
// const newNumbers = Number(num);

// const multiplication = function () {
//   let arr = [];
//   //   console.log(arr);
//   for (let i = 0; i < arguments.length; i += 1) {
//     arr.push(arguments[i]);
//   }

//   let newArr = 0;
//   for (let i = 0; i < arr.length; i += 1) {
//     newArr = arr[i];
//   }
//   console.log(newArr);

//   return newArr;
// };

// console.log(multiplication(newNumbers));

// multiplication(newNumbers);

////////////////////////////////////////////////////////////////////////////////

// преобразует строку '12345' в массив чисел [1, 2, 3, 4, 5]

// const num = "12345";
// const getNumbers = function (num) {
//   let res = [];
//   let base = 10;
//   let currNum = Math.abs(num);
//   do {
//     let baseShiftedNum = Math.floor(currNum / base);
//     let diff = currNum - baseShiftedNum * base;
//     res.unshift(diff);
//     currNum = baseShiftedNum;
//   } while (currNum > 0);
//   console.log(res);
//   return res;
// };

// getNumbers(num);

// const newNumbers = Number(num);

////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////// Работа с массивами \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
////////////////////////////////////////////////////////////////////////////////////////////////

// Создайте массив arr = ['a', 'b', 'c'].Выведите его на экран с помощью функции alert.

// const arr = ["a", "b", "c"];
// alert(arr);

////////////////////////////////////////////////////////////////////////////////////////////////
// С помощью массива arr из предыдущего номера выведите на экран содержимое первого,
// второго и третьего элементов.

// const arr = ["a", "b", "c"];
// alert(arr[0] + arr[1] + arr[2]);

////////////////////////////////////////////////////////////////////////////////////////////////
//Создайте массив arr = ['a', 'b', 'c', 'd'] и с его помощью выведите на экран строку 'a+b, c+d'.

// const arr = ["a", "b", "c", "d"];
// console.log(`${arr[0]} + ${arr[1]}, ${arr[2]} + ${arr[3]}`);

////////////////////////////////////////////////////////////////////////////////////////////////
// Создайте массив arr с элементами 2, 5, 3, 9. Умножьте первый элемент массива на второй,
// а третий элемент на четвертый.Результаты сложите, присвойте переменной result.
// Выведите на экран значение этой переменной.

// const arr = [2, 5, 3, 9];
// const first = arr[0] * arr[1];
// const second = arr[2] * arr[3];
// const result = first + second;

// console.log(result);

////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////// Объекты(ассоциативные массивы) \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
////////////////////////////////////////////////////////////////////////////////////////////////
// Создайте объект obj.Выведите на экран элемент с ключом 'c' двумя способами:
//bчерез квадратные скобки и как свойство объекта:
// var obj = { a: 1, b: 2, c: 3 };

////////////////////////////////////////////////////////////////////////////////////////////////

// Создайте массив заработных плат obj.Выведите на экран зарплату Пети и Коли.
// var obj = { Коля: '1000', Вася: '500', Петя: '200' };

////////////////////////////////////////////////////////////////////////////////////////////////

// Создайте объект с днями недели.Ключами в нем должны служить номера дней от
//начала недели(понедельник - первый и т.д.).Выведите на экран текущий день недели.

////////////////////////////////////////////////////////////////////////////////////////////////

// Пусть теперь номер дня недели хранится в переменной day, например там лежит число 3.
//Выведите день недели, соответствующий значению переменной day.
